#### 📖 Terraform Plan ('src/core/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.key_vault_weu.azurerm_key_vault_access_policy.kv_adgroup_platform_admins will be created
  + resource "azurerm_key_vault_access_policy" "kv_adgroup_platform_admins" {
      + certificate_permissions = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv"
      + object_id               = "a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault_weu.azurerm_key_vault_access_policy.kv_common_adgroup_platform_admins will be created
  + resource "azurerm_key_vault_access_policy" "kv_common_adgroup_platform_admins" {
      + certificate_permissions = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id               = "a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.storage_accounts_itn.module.iam_adgroup_platform_admins.module.storage_account.azurerm_role_assignment.blob["iopitntfst001|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/terraform-state-rg/providers/Microsoft.Storage/storageAccounts/iopitntfst001"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.azdoa_weu.module.azdoa_snet.azurerm_subnet.this,
  on .terraform/modules/azdoa_weu.azdoa_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 11 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
